Конфигурация/src/Documents/ОтгрузкаКлиенту/ОтгрузкаКлиенту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтгрузкаКлиенту</name>
  <registerRecords>AccumulationRegister.ОстаткиПродукции</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.ПродукцияИМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/Documents/ОтгрузкаКлиенту/Forms/ОтгрузкаКлиенту/Module.bsl
&НаКлиенте
Процедура ПродукцияЦенаПриИзменении(Элемент)
	ПересчитатьСуммуСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияКоличествоПриИзменении(Элемент)
	ПересчитатьСуммуСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуСтроки()
	
    // ВНИМАНИЕ: Продукция — это имя элемента (таблицы) на форме
	ТекущиеДанные = Элементы.Продукция.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
        Количество = ?(ТекущиеДанные.Количество = Неопределено, 0, ТекущиеДанные.Количество);
        Цена = ?(ТекущиеДанные.Цена = Неопределено, 0, ТекущиеДанные.Цена);
        
		// Выполняем расчет и записываем результат в реквизит "Сумма"
		ТекущиеДанные.Сумма = Количество * Цена;
		
	КонецЕсли;
	
КонецПроцедуры
